application/gds/travelport/requests/AirCreateReservationReq.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <AirCreateReservationReq xmlns="http://www.travelport.com/schema/universal_v33_0"
                                 TraceId="53fd748c-f6a7-443e-9685-56cdbfcebfe8" AuthorizedBy="{AUTHORIZED_BY}"
                                 TargetBranch="{TARGET_BRANCH}" ProviderCode="1G" RetainReservation="Both">
            <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v33_0" OriginApplication="UAPI"/>
            <BookingTraveler xmlns="http://www.travelport.com/schema/common_v33_0" Key="WVNaRlJJQzVtUlUyNmw3eQ=="
                             TravelerType="{TRAVELLER_TYPE}" Age="{TRAVELLER_AGE}" DOB="{TRAVELLER_DOB}" Gender="{TRAVELLER_GENDER}" Nationality="{TRAVELLER_NATIONALITY}">
                <BookingTravelerName Prefix="{TRAVELLER_PREFIX}" First="{TRAVELLER_FIRSTNAME}"
                                     Last="{TRAVELLER_LASTNAME}"/>
                <DeliveryInfo>
                    <ShippingAddress Key="1">
                        <Street>{SHIPPING_STREET}</Street>
                        <City>{SHIPPING_CITY}</City>
                        <PostalCode>{SHIPPING_POSTALCODE}</PostalCode>
                    </ShippingAddress>
                </DeliveryInfo>
                <PhoneNumber Location="{PHONE_LOCATION}" CountryCode="{PHONE_COUNTRYCODE}" AreaCode="{PHONE_AREACODE}"
                             Number="{PHONE_NUMBER}"/>
                <Email EmailID="{TRAVELLER_EMAIL}"/>
                <Address>
                    <AddressName>{ADDRESS_NAME}</AddressName>
                    <Street>{ADDRESS_STREET}</Street>
                    <City>{ADDRESS_CITY}</City>
                    <State>{ADDRESS_STATE}</State>
                    <PostalCode>{ADDRESS_POSTALCODE}</PostalCode>
                    <Country>{ADDRESS_COUNTRY}</Country>
                </Address>
            </BookingTraveler>
            <FormOfPayment xmlns="http://www.travelport.com/schema/common_v33_0" Type="Credit" Key="1">
                <CreditCard Type="{CREDITCARD_TYPE}" Number="{CREDITCARD_NUMBER}" ExpDate="{CREDITCARD_EXPDATE}"
                            Name="{CREDITCARD_NAME}" CVV="{CREDITCARD_CVV}" Key="1">
                    <BillingAddress Key="952b306d-6a05-4cb4-bfab-9b06f546d166">
                        <AddressName>{ADDRESS_NAME}</AddressName>
                        <Street>{ADDRESS_STREET}</Street>
                        <City>{ADDRESS_CITY}</City>
                        <State>{ADDRESS_STATE}</State>
                        <PostalCode>{ADDRESS_POSTALCODE}</PostalCode>
                        <Country>{ADDRESS_COUNTRY}</Country>
                    </BillingAddress>
                </CreditCard>
            </FormOfPayment>
            <AirPricingSolution xmlns="http://www.travelport.com/schema/air_v33_0" Key="jAVK7yMXRka1mFPHrp3VGw=="
                                TotalPrice="{AIR_TOTALPRICE}" BasePrice="{AIR_BASEPRICE}"
                                ApproximateTotalPrice="{AIR_APPRX_TOTALPRICE}"
                                ApproximateBasePrice="{AIR_APPRX_BASEPRICE}"
                                EquivalentBasePrice="{AIR_APPRX_TOTALPRICE}" Taxes="{AIR_TAXES}">

                {AIR_SEGMENTS}

                <AirPricingInfo PricingMethod="Auto" Taxes="GBP45.26" Key="TrWp2IfGSOmXRquWCp2p9w=="
                                TotalPrice="GBP91.26" BasePrice="EUR64.00" ApproximateTotalPrice="GBP91.26"
                                ApproximateBasePrice="GBP46.00" ProviderCode="1G">
                    <FareInfo PromotionalFare="false" FareFamily="Economy" Amount="" DepartureDate="2016-04-21"
                              EffectiveDate="2016-04-11T15:20:00.000+00:00" Destination="LGW" Origin="AMS"
                              PassengerTypeCode="ADT" FareBasis="OV1WO" Key="y4kUx16CRbWwD/n3H3M73g==">
                        <FareRuleKey FareInfoRef="y4kUx16CRbWwD/n3H3M73g==" ProviderCode="1G">
                            6UUVoSldxwiIe/38RmBvvsbKj3F8T9EyxsqPcXxP0TIjSPOlaHfQe5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA+AuvJxoI2WTM3ExqSoG052l+I8CYW5AicFC+Ey0yF7hVCulqMwbpNasTsU9/OBUclD+Zqy1lXNNkQKXLoN+n+rq/20RpEmAXlby9IE1rxlSp7GoYpQef1jkFTBfI0oSAbhHOJ4mOxpTFVHsNy1BaPCAdcY0m0a4yk4nKb2G5mOFzxa1NF1CGc6dwA9tVe1DAL+F729rtUMfv4Xvb2u1Qx+/he9va7VDH7+F729rtUMfv4Xvb2u1Qx80GqQ2wgDK/01BlpTwyo+r9GjARZYw7j/TROTkGAG0MckOd+xc8l3uMVpbxs3B+fbcF7TvWtaxD45yzlpSDq4S
                        </FareRuleKey>
                        <Brand Key="1" BrandID="7812" Name="Economy" Carrier="BA">
                            <Title Type="External">Economy</Title>
                            <Title Type="Short">Economy</Title>
                            <Text Type="MarketingAgent">•1 piece of hand baggage

                                •1 x 23kg of checked baggage allowance

                                •Complimentary onboard food and bar service

                                •Airport, online or mobile check-in

                                •Free seat selection 24hrs in advance

                                •Complimentary newspapers before you board

                                •Flights to and from centrally located airports

                                •Non refundable
                            </Text>
                            <Text Type="Strapline">Economy</Text>
                        </Brand>
                    </FareInfo>
                    <FareInfo PromotionalFare="false" FareFamily="Economy" Amount="GBP23.00" DepartureDate="2016-04-23"
                              EffectiveDate="2016-04-11T15:20:00.000+00:00" Destination="AMS" Origin="LGW"
                              PassengerTypeCode="ADT" FareBasis="OV1WO" Key="H1gEZv28RxOn/1hGlvU1DQ==">
                        <FareRuleKey FareInfoRef="H1gEZv28RxOn/1hGlvU1DQ==" ProviderCode="1G">
                            6UUVoSldxwiIe/38RmBvvsbKj3F8T9EyxsqPcXxP0TIjSPOlaHfQe5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA+AuvJxoI2WTM3ExqSoG050WS9l+4/GFk1p1wpGyX3WAffAIozri2ACsTsU9/OBUclD+Zqy1lXNNFTa6IPaP2BLq/20RpEmAXlby9IE1rxlSp7GoYpQef1jkFTBfI0oSAbhHOJ4mOxpTFVHsNy1BaPA8sv0OdkDoiE4nKb2G5mOFbclfE2ricN2dwA9tVe1DAL+F729rtUMfv4Xvb2u1Qx+/he9va7VDH7+F729rtUMfv4Xvb2u1Qx80GqQ2wgDK/01BlpTwyo+r9GjARZYw7j/TROTkGAG0MckOd+xc8l3uMVpbxs3B+fbcF7TvWtaxD45yzlpSDq4S
                        </FareRuleKey>
                        <Brand Key="2" BrandID="7812" Name="Economy" Carrier="BA">
                            <Title Type="External">Economy</Title>
                            <Title Type="Short">Economy</Title>
                            <Text Type="MarketingAgent">•1 piece of hand baggage

                                •1 x 23kg of checked baggage allowance

                                •Complimentary onboard food and bar service

                                •Airport, online or mobile check-in

                                •Free seat selection 24hrs in advance

                                •Complimentary newspapers before you board

                                •Flights to and from centrally located airports

                                •Non refundable
                            </Text>
                            <Text Type="Strapline">Economy</Text>
                        </Brand>
                    </FareInfo>
                    <BookingInfo BookingCode="O" CabinClass="Economy" FareInfoRef="y4kUx16CRbWwD/n3H3M73g=="
                                 SegmentRef="lXZvJjFRSP60Fb1NikXcoA=="/>
                    <BookingInfo BookingCode="O" CabinClass="Economy" FareInfoRef="H1gEZv28RxOn/1hGlvU1DQ=="
                                 SegmentRef="9XQqT7kORwOwg2F7MNEr3g=="/>
                    <TaxInfo Key="maUnYWE3T9eetBOAjLeuxg==" Category="GB" Amount="GBP13.00"/>
                    <TaxInfo Key="SAvPd9AwQHeA6lEswcS4xw==" Category="UB" Amount="GBP12.66"/>
                    <TaxInfo Key="ikOV0ZPNS9KbeVd7//KFGA==" Category="CJ" Amount="GBP8.80"/>
                    <TaxInfo Key="+Jvta4tcT2S9h4MQqWDVow==" Category="RN" Amount="GBP10.40"/>
                    <TaxInfo Key="4vEbOHngTBuHDw33SMbcsQ==" Category="VV" Amount="GBP0.40"/>
                    <PassengerType Code="ADT" Age="40" BookingTravelerRef="WVNaRlJJQzVtUlUyNmw3eQ=="/>
                </AirPricingInfo>
            </AirPricingSolution>
            <ActionStatus xmlns="http://www.travelport.com/schema/common_v33_0" Type="ACTIVE" TicketDate="T*"
                          ProviderCode="1G"/>
        </AirCreateReservationReq>
    </soapenv:Body>
</soapenv:Envelope>
